app/controllers/articles_controller.rb

  def index
    @articles = Article.all.order("created_at desc").paginate(page: params[:page], per_page: 2)
---
SELECT  "articles".* FROM "articles"  ORDER BY created_at desc LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "articles"

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "content", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "New test"], ["updated_at", "2016-07-26 23:06:37.284971"], ["id", 4]]