app/controllers/projects_controller.rb

  def index
    @projects = Project.all.order("created_at desc").paginate(page: params[:page], per_page: 2)
---
SELECT  "projects".* FROM "projects"  ORDER BY created_at desc LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "projects"

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("title", "description", "github", "web", "image", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "image" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["image", "http://maison-cresci.fr/uploads/images/nice_cresci_slide_environnement_003.jpg"], ["updated_at", "2016-07-26 23:21:44.687584"], ["id", 6]]