app/controllers/welcome_controller.rb

  def index
  	@articles = Article.all.limit(3).order("created_at desc")
  	@projects = Project.all.limit(3).order("created_at desc")
---
SELECT  "articles".* FROM "articles"  ORDER BY created_at desc LIMIT 3
SELECT  "projects".* FROM "projects"  ORDER BY created_at desc LIMIT 3